#include <bits/stdc++.h>

using namespace std;

int n, s;

void step1() {
    cout << "Какую фигуру вы рассматриваете? (выберите цифру)" << "\n";
    cout << "\n";
    
    cout << "Параллелепипед - 1" << "\n";
    cout << "Частный случай параллелепипеда:" << "\n";
    cout << "   Куб - 11" << "\n";
    cout << "   Прямоугольный параллелепипед - 12" << "\n";
    cout << "\n";
    
    cout << "Тетраэдр - 2" << "\n";
    cout << "Частный случай тетраэдра:" << "\n";
    cout << "   Правильный тетраэдр - 21" << "\n";
    cout << "   Прямоугольный тетраэдр - 22" << "\n";
    cout << "\n";
    
    cout << "Пирамида - 3" << "\n";
    cout << "Частный случай пирамиды:" << "\n";
    cout << "   Правильная пирамида - 31" << "\n";
    cout << "\n";
    
    cout << "Призма - 4" << "\n";
    cout << "Частный случай призмы:" << "\n";
    cout << "   Прямая призма - 41" << "\n";
    cout << "   Правильная призма - 42" << "\n";
    cout << "\n";
    
    cin >> n;
    
    while ((n != 1) && (n != 11) && (n != 12) && (n != 2) && (n != 21) && (n != 22) && (n != 3) && (n != 31) && (n != 4) && (n != 41) && (n != 42)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> n;
    }
}


void qs() {
    cout << "\n";
    cout << "Что вам известно? (выберите цифру)" << "\n";
    cout << "\n";
}

void step2_1() {
    cout << "Сторона - 1" << "\n";
    cout << "Диагональ грани - 2" << "\n";
    cout << "Диагональ фигуры - 3" << "\n";
    cout << "Периметр - 4" << "\n";
    cout << "Площадь - 5" << "\n";
    cout << "Объём - 6" << "\n";
}

void step2_2() {
    cout << "Высота - 7" << "\n";
    cout << "Апофема - 8" << "\n";
}

void step2_3() {
    cout << "Угол - 9" << "\n";
}

//////////////////////////////////////////////SOLVE///////////////////////////////////////////////////////////////////

void solve1() {
    step2_3();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 9)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve11() {
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve12() {
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve2() {
    step2_2();
    step2_3();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8) && (s != 9)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve21() {
    step2_2();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve22() {
    step2_2();
    step2_3();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8) && (s != 9)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve3() {
    step2_2();
    step2_3();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8) && (s != 9)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve31() {
    step2_2();
    step2_3();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8) && (s != 9)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve4() {
    step2_2();
    step2_3();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8) && (s != 9)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve41() {
    step2_2();
    step2_3();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8) && (s != 9)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

void solve42() {
    step2_2();
    
    cout << "\n";
    
    cin >> s;
    
    while ((s != 1) && (s != 2) && (s != 3) && (s != 4) && (s != 5) && (s != 6) && (s != 7) && (s != 8)) {
        cout << "Вы ввели некорректные данные, повторите ввод" << "\n";
        cin >> s;
    }
}

int main() {
    step1();
    qs();
    step2_1();
    switch (n) {
        case 1:
            solve1();
            break;
            
        case 11:
            solve11();
            break;
            
        case 12:
            solve12();
            break;
            
        case 2:
            solve2();
            break;
            
        case 21:
            solve21();
            break;
            
        case 22:
            solve22();
            break;
            
        case 3:
            solve3();
            break;
            
        case 31:
            solve31();
            break;
            
        case 4:
            solve4();
            break;
            
        case 41:
            solve41();
            break;
            
        case 42:
            solve42();
            break;
    }
}
